Revit 2027 API
ExternalServices.BuiltInExternalServices.AlignmentService Property
 Autodesk Internal: The service for Infrastructure Alignments
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId AlignmentService { get; }
Public Shared ReadOnly Property AlignmentService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ AlignmentService {
	ExternalServiceId^ get ();
}
static member AlignmentService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace